nguyentri/nuttx/boards/arm/ra8/fpb-ra8e1/src/ra8e1_pwm_escs_demo.c
static int ra8e1_pwm_initialize(void)
{
  static bool initialized = false;
  struct pwm_lowerhalf_s *pwm;
  int ret;
  int i;

  /* Have we already initialized? */

  if (initialized)
    {
      return OK;
    }

  pwminfo("Initializing ESC PWM drivers\n");

  /* Setup GPIO pins for PWM */

  ret = ra8e1_pwm_setup_pins();
  if (ret < 0)
    {
      pwmerr("ERROR: PWM pin setup failed: %d\n", ret);
      return ret;
    }

  /* Initialize GPT0 for ESC2 (P415) */

  pwm = ra_gpt_initialize(0);
  if (!pwm)
    {
      pwmerr("ERROR: Failed to get GPT0 PWM lower half\n");
      return -ENODEV;
    }

  ret = pwm_register("/dev/pwm0", pwm);
  if (ret < 0)
    {
      pwmerr("ERROR: Failed to register /dev/pwm0: %d\n", ret);
      return ret;
    }

  g_pwm_esc_devs[1] = pwm;  /* ESC2 maps to PWM0/GPT0 */
  pwminfo("ESC2 PWM driver registered at /dev/pwm0\n");

  /* Initialize GPT2 for ESC3 (P114) */

  pwm = ra_gpt_initialize(2);
  if (!pwm)
    {
      pwmerr("ERROR: Failed to get GPT2 PWM lower half\n");
      return -ENODEV;
    }

  ret = pwm_register("/dev/pwm2", pwm);
  if (ret < 0)
    {
      pwmerr("ERROR: Failed to register /dev/pwm2: %d\n", ret);
      return ret;
    }

  g_pwm_esc_devs[2] = pwm;  /* ESC3 maps to PWM2/GPT2 */
  pwminfo("ESC3 PWM driver registered at /dev/pwm2\n");

  /* Initialize GPT3 for ESC1 (P300) */

  pwm = ra_gpt_initialize(3);
  if (!pwm)
    {
      pwmerr("ERROR: Failed to get GPT3 PWM lower half\n");
      return -ENODEV;
    }

  ret = pwm_register("/dev/pwm3", pwm);
  if (ret < 0)
    {
      pwmerr("ERROR: Failed to register /dev/pwm3: %d\n", ret);
      return ret;
    }

  g_pwm_esc_devs[0] = pwm;  /* ESC1 maps to PWM3/GPT3 */
  pwminfo("ESC1 PWM driver registered at /dev/pwm3\n");

  /* Initialize GPT4 for ESC4 (P302) */

  pwm = ra_gpt_initialize(4);
  if (!pwm)
    {
      pwmerr("ERROR: Failed to get GPT4 PWM lower half\n");
      return -ENODEV;
    }

  ret = pwm_register("/dev/pwm4", pwm);
  if (ret < 0)
    {
      pwmerr("ERROR: Failed to register /dev/pwm4: %d\n", ret);
      return ret;
    }

  g_pwm_esc_devs[3] = pwm;  /* ESC4 maps to PWM4/GPT4 */
  pwminfo("ESC4 PWM driver registered at /dev/pwm4\n");

  initialized = true;
  pwminfo("All ESC PWM drivers initialized successfully\n");
  return OK;
}

/****************************************************************************
 * Name: ra8e1_pwm_setup
 *
 * Description:
 *   Initialize PWM and register the PWM device.
 *
 ****************************************************************************/

static int ra8e1_pwm_setup(void)
{
  return ra8e1_pwm_initialize();
}

/****************************************************************************
 * Name: ra8e1_esc_get_pwm_dev
 *
 * Description:
 *   Get PWM lower half device for specified ESC
 *
 * Input Parameters:
 *   esc_index - ESC index (0-3)
 *
 * Returned Value:
 *   PWM device pointer on success, NULL on failure.
 *
 ****************************************************************************/

static struct pwm_lowerhalf_s *ra8e1_esc_get_pwm_dev(int esc_index)
{
  if (esc_index < 0 || esc_index >= 4)
    {
      return NULL;
    }

  return g_pwm_esc_devs[esc_index];
}

#ifdef CONFIG_PWM_HAVE_DUTY16
/****************************************************************************
 * Name: ra8e1_esc_set_duty_us
 *
 * Description:
 *   Set ESC PWM duty cycle using microsecond pulse width
 *
 * Input Parameters:
 *   esc_index - ESC index (0-3)
 *   pulse_us  - Pulse width in microseconds (1000-2000 for ESCs)
 *   frequency - PWM frequency in Hz (typically 400)
 *
 * Returned Value:
 *   Zero on success; negated errno on failure.
 *
 ****************************************************************************/

static int ra8e1_esc_set_duty_us(int esc_index, uint32_t pulse_us, uint32_t frequency)
{
  struct pwm_lowerhalf_s *pwm;
  struct pwm_info_s info;
  uint32_t period_us;
  uint32_t duty_frac;

  if (esc_index < 0 || esc_index >= 4)
    {
      return -EINVAL;
    }

  pwm = g_pwm_esc_devs[esc_index];
  if (!pwm)
    {
      return -ENODEV;
    }

  /* Calculate duty cycle as fraction of period */

  period_us = 1000000 / frequency;  /* Period in microseconds */
  duty_frac = (pulse_us * 65536) / period_us;  /* 16-bit duty fraction */

  /* Prepare PWM info */

  info.frequency = frequency;
  info.duty = duty_frac;

  /* Set the PWM */

  return PWM_START(pwm, &info);
}
#endif

/****************************************************************************
 * Name: ra8e1_esc_stop_all
 *
 * Description:
 *   Stop all ESC PWM outputs
 *
 * Returned Value:
 *   Zero on success; negated errno on failure.
 *
 ****************************************************************************/

static int ra8e1_esc_stop_all(void)
{
  int ret = OK;
  int i;

  for (i = 0; i < 4; i++)
    {
      if (g_pwm_esc_devs[i])
        {
          if (PWM_STOP(g_pwm_esc_devs[i]) < 0)
            {
              pwmerr("ERROR: Failed to stop ESC%d PWM\n", i + 1);
              ret = -EIO;
            }
        }
    }

  return ret;
}

/****************************************************************************
 * Name: esc_pwm_open
 *
 * Description:
 *   Open PWM device for specified ESC channel
 *
 ****************************************************************************/

static int esc_pwm_open(int esc_index)
{
  struct pwm_info_s info;
  int ret;

  if (esc_index < 0 || esc_index >= NUM_ESC_CHANNELS)
    {
      return -EINVAL;
    }

  if (g_esc_channels[esc_index].fd >= 0)
    {
      /* Already open */
      return OK;
    }

  /* Open PWM device */

  g_esc_channels[esc_index].fd = open(g_esc_channels[esc_index].device_path,
                                      O_RDONLY);
  if (g_esc_channels[esc_index].fd < 0)
    {
      demoprintf("ERROR: Failed to open %s: %d\n",
             g_esc_channels[esc_index].device_path, errno);
      return -errno;
    }

  /* Configure PWM */

  info.frequency = ESC_PWM_FREQUENCY;
  info.duty = 0;

  ret = ioctl(g_esc_channels[esc_index].fd, PWMIOC_SETCHARACTERISTICS,
              (unsigned long)&info);
  if (ret < 0)
    {
      demoprintf("ERROR: Failed to configure PWM%d: %d\n", esc_index, errno);
      close(g_esc_channels[esc_index].fd);
      g_esc_channels[esc_index].fd = -1;
      return -errno;
    }

  demoprintf("ESC%d: PWM device opened and configured\n", esc_index + 1);
  return OK;
}

/****************************************************************************
 * Name: esc_pwm_close
 *
 * Description:
 *   Close PWM device for specified ESC channel
 *
 ****************************************************************************/

static int esc_pwm_close(int esc_index)
{
  if (esc_index < 0 || esc_index >= NUM_ESC_CHANNELS)
    {
      return -EINVAL;
    }

  if (g_esc_channels[esc_index].fd >= 0)
    {
      /* Stop PWM before closing */
      ioctl(g_esc_channels[esc_index].fd, PWMIOC_STOP, 0);

      close(g_esc_channels[esc_index].fd);
      g_esc_channels[esc_index].fd = -1;
      g_esc_channels[esc_index].armed = false;
      g_esc_channels[esc_index].current_throttle = 0;
    }

  return OK;
}

/****************************************************************************
 * Name: esc_set_throttle_us
 *
 * Description:
 *   Set ESC throttle using pulse width in microseconds
 *
 ****************************************************************************/

